Revit 2027 API
PathReinforcement.IsValidPrimaryBarOrientation Method
 Checks if orientation for primary bars is valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidPrimaryBarOrientation(
	ReinforcementBarOrientation orientation
)
Public Function IsValidPrimaryBarOrientation (
	orientation As ReinforcementBarOrientation
) As Boolean
public:
bool IsValidPrimaryBarOrientation(
	ReinforcementBarOrientation orientation
)
member IsValidPrimaryBarOrientation :
        orientation : ReinforcementBarOrientation -> bool
Parameters
orientation ReinforcementBarOrientation
 An orientation.
Return Value
Boolean
 True if orientation for primary bars are valid.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace